src/DataProcessors/ИнструментыРазработчикаВерсионированиеОбъектовГенераторВерсийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ИнструментыРазработчикаВерсионированиеОбъектовГенераторВерсийОбъектов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВерсийОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыВерсийОбъекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзмененоПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыеДанныеПоКоллизии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепринятыеДанныеПоКоллизии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепринятыеДанныеПоДатеЗапретаОбъектСуществует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепринятыеДанныеПоДатеЗапретаОбъектНеСуществует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИнструментыРазработчикаВерсионированиеОбъектовГенераторВерсийОбъектов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сгенерировать(Команда)
	Прогресс = 0;
	Элементы.Прогресс.МаксимальноеЗначение = КоличествоВерсий;
	ПодключитьОбработчикОжидания("СгенерироватьПорцию", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВерсииОбъекта(Команда)
	ОчиститьРегистрНаСервере(ВерсионируемыйОбъект);
	ПоказатьПредупреждение(, НСтр("ru = 'Очистка завершена'"));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРегистр(Команда)
	ОчиститьРегистрНаСервере();
	ПоказатьПредупреждение(, НСтр("ru = 'Очистка завершена'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СгенерироватьПорцию()
	РазмерПорции = 5000;
	Если РазмерПорции > КоличествоВерсий - Прогресс Тогда
		РазмерПорции = КоличествоВерсий - Прогресс;
	КонецЕсли;
	СгенерироватьНаСервере(ВерсионируемыйОбъект, РазмерПорции, ДатаВерсий);
	Прогресс = Прогресс + РазмерПорции;
	
	Если Прогресс < КоличествоВерсий Тогда
		ПодключитьОбработчикОжидания("СгенерироватьПорцию", 0.1, Истина);
	КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СгенерироватьНаСервере(Ссылка, Количество, ДатаВерсий)
	НомерПоследнейВерсии = ВерсионированиеОбъектов.НомерПоследнейВерсии(Ссылка);
	АвторВерсии = Пользователи.АвторизованныйПользователь();
	ДанныеОбъекта = СериализоватьОбъект(Ссылка.ПолучитьОбъект());
	ВерсияОбъекта = Новый ХранилищеЗначения(ДанныеОбъекта, Новый СжатиеДанных(9));
	
	НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
	Для Счетчик = 1 По Количество Цикл
		НомерВерсии = НомерПоследнейВерсии + Счетчик;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Ссылка;
		Запись.НомерВерсии = НомерВерсии;
		Запись.ДатаВерсии = ДатаВерсий;
		Запись.АвторВерсии = АвторВерсии;
		Запись.ТипВерсииОбъекта = Перечисления.ТипыВерсийОбъекта.ИзмененоПользователем;
		Запись.ВерсияОбъекта = ВерсияОбъекта;
	КонецЦикла;
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СериализоватьОбъект(Объект)
	ЗаписьXML = Новый ЗаписьFastInfoset;
	ЗаписьXML.УстановитьДвоичныеДанные();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Явное);
	Возврат ЗаписьXML.Закрыть();
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьРегистрНаСервере(Объект = Неопределено)
	НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
	Если Объект <> Неопределено Тогда
		НаборЗаписей.Отбор.Объект.Установить(Объект);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
	КонецЕсли;
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти
